swagger/src/Enums/ИсточникиСервиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>ИсточникиСервиса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнешняяСсылка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстоваяСпецификация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъектнаяСпецификация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

swagger/src/Catalogs/ОбъектыАвторизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ОбъектыАвторизации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

swagger/src/Catalogs/МакетыБлоков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>МакетыБлоков</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШаблонМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидИсточникаДанных</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыИсточниковДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникДанных</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Список</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВходящиеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДляПроверки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

swagger/src/Catalogs/ПредоставляемыеСервисы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ПредоставляемыеСервисы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UrlРесурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>title</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>summary</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>termsOfService</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>version</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>contactName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>contactUrl</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>contactEmail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>licanseName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>licanseUrl</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>licanseIdentifier</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСервиса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиСервиса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>externalDocs</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>components</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>servers</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Server</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сервера</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>paths</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>path</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>pathItem</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пути</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>tags</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>tag</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Теги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

swagger/src/CommonModules/ВыборкаДанныхСайтСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  Модуль для выборки данных з БД для запросов
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// Возвращает ссылку на вариант отчета.
//
// Параметры:
//  ИнфоОПользователе - структура, которая формируется в http-сервисах
//
// Возвращаемое значение:
//  Структура с произвольным набором ключей
//
Функция ПолучитьДанныеПользователя(ИнфоОПользователе) Экспорт 
	Результат = ПолучитьПустуюСтруктуруДанныхПользователя();
	
	Пользователь = ИнфоОПользователе.Пользователь;
	Результат.Вставить("Пользователь", Пользователь);
	Результат.Вставить("Сессия", ИнфоОПользователе.Сессия);
	Результат.Вставить("ИмяПользователя", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "Наименование"));
	
	//В некоторых случаях необходимо предоставить авторизацию в личном кабинете в разрезе других 
	//справочников (Контрагенты, партнеры и т.д.)
	//тип этих справочников можно задать в определяемом типе ОбъектАвторизации, т.к. он от базы к базе может меняться
	//тут для примера добавлен справочник ОбъектыАвторизации
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОбъектыАвторизации.Ссылка КАК ОбъектАвторизации
	|ИЗ
	|	Справочник.ОбъектыАвторизации КАК ОбъектыАвторизации
	|ГДЕ
	|	ОбъектыАвторизации.Пользователь = &Пользователь
	|	И ОбъектыАвторизации.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Результат.Вставить("ОбъектАвторизации", Выборка.ОбъектАвторизации)
		КонецЦикла; 
		
		//структуру можно дополнять каким угодно способом, чтобы потом использовать 
		//в http-сервисах
		//данные Объекта
		Результат.Вставить("ДанныеОбъектАвторизации", ПолучитьДанныеОбъектАвторизации(Результат.ОбъектАвторизации));
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьМакетБлокаПоИД(ИД) Экспорт 
	Возврат Справочники.МакетыБлоков.ПолучитьСсылку(Новый УникальныйИдентификатор(ИД));
КонецФункции

Функция ЭкранированиеКавычек(Знач Текст) Экспорт 
	Результат = СтрЗаменить(Текст, "", "&quot;");
	
	Возврат Результат;
КонецФункции

Функция ПолучитьСписокСервисов() Экспорт 
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПредоставляемыеСервисы.Идентификатор КАК Идентификатор,
	|	ПредоставляемыеСервисы.ИсточникСервиса КАК ИсточникСервиса,
	|	ПредоставляемыеСервисы.UrlРесурса КАК UrlРесурса,
	|	ПредоставляемыеСервисы.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ПредоставляемыеСервисы КАК ПредоставляемыеСервисы
	|ГДЕ
	|	ПредоставляемыеСервисы.ПометкаУдаления = ЛОЖЬ
	|	И ПредоставляемыеСервисы.Отключен = ЛОЖЬ";
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Сервис = Новый Соответствие;
		Сервис.Вставить("url", ?(Выборка.ИсточникСервиса = ПредопределенноеЗначение("Перечисление.ИсточникиСервиса.ВнешняяСсылка"), Выборка.UrlРесурса, "/" + ОбщегоНазначенияСайтПовтИсп.ИмяПубликации() + "/index/service/" + Выборка.Идентификатор));
		Сервис.Вставить("name", Выборка.Наименование);
		
		Результат.Добавить(Сервис);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьОписаниеСервиса(ИдентификаторСервиса) Экспорт 
	Результат = Новый Соответствие;
	
	Сервис = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПредоставляемыеСервисы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПредоставляемыеСервисы КАК ПредоставляемыеСервисы
	|ГДЕ
	|	ПредоставляемыеСервисы.ПометкаУдаления = ЛОЖЬ
	|	И ПредоставляемыеСервисы.Отключен = ЛОЖЬ
	|	И ПредоставляемыеСервисы.Идентификатор = &Идентификатор";
	Запрос.УстановитьПараметр("Идентификатор", ИдентификаторСервиса);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Ссылка = Выборка.Ссылка;
		Сервис = Ссылка.ПолучитьОбъект();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Если Ложь Тогда
		Сервис = Справочники.ПредоставляемыеСервисы.СоздатьЭлемент();
	КонецЕсли;
	
	Если Сервис.ИсточникСервиса = ПредопределенноеЗначение("Перечисление.ИсточникиСервиса.ТекстоваяСпецификация") Тогда
		Возврат Сервис.Описание;
	КонецЕсли;
	
	Возврат Сервис.СформироватьJsonSwagger();
КонецФункции
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеОбъектАвторизации(ОбъектАвторизации)
	Результат = Неопределено;
	
	
	
	Возврат Результат;
КонецФункции

Функция ПолучитьПустуюСтруктуруДанныхПользователя()
	Результат = Новый Структура;
	
	Результат.Вставить("ОбъектАвторизации", Неопределено);
	Результат.Вставить("Пользователь", Неопределено);
	Результат.Вставить("ИмяПользователя", Неопределено);
	
	
	Возврат Результат;
КонецФункции

#КонецОбласти
